app/controllers/carts_controller.rb

  def show
    @order_items = current_order.order_items
---
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  ORDER BY "order_items"."id" ASC LIMIT 1  [["order_id", 2]]

  def checkout
    @items = current_order.order_items
---
SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 5]]