app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
  def index
    @issues = Issue.all
    @order_item = current_order.order_items.new

INSERT INTO "issues" ("created_at", "date", "mark", "picture", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-21 12:29:13.707771"], ["date", "2015-01-21"], ["mark", "22"], ["picture", ""], ["title", ""], ["updated_at", "2015-01-21 12:29:13.707771"]]
---
  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save

UPDATE "issues" SET "mark" = ?, "updated_at" = ? WHERE "issues"."id" = 1  [["mark", "1/20153"], ["updated_at", "2015-01-25 20:24:13.235286"]]
---
  def update
    respond_to do |format|
      if @issue.update(issue_params)