app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "orders" SET "shipping" = ?, "subtotal" = ?, "total" = ?, "updated_at" = ? WHERE "orders"."id" = 5  [["shipping", 5.0], ["subtotal", 25.97], ["total", 30.97], ["updated_at", "2015-02-15 14:09:39.505237"]]
---
  def update
    if params[:id]
      @order = Order.find(params[:id])
    else
      @order = current_order
    end

    respond_to do |format|
      if @order.update(order_params)