app/controllers/order_positions_controller.rb

SELECT "order_positions".* FROM "order_positions"
---
  def index
    @order_positions = OrderPosition.all