app/controllers/order_items_controller.rb

  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    if @order.save
      @issue = Issue.find(@order_item.issue_id)
      current = @issue.volume
      if current < @order_item.quantity
        session[:return_to] ||= request.referer
        respond_to do |format|
        if @order_item.destroy
          format.html { redirect_to session.delete(:return_to), notice: 'No chyba nie!' }
          format.json { head :no_content }
        end
      end
      else
        current = current - @order_item.quantity
        @issue.update_attributes(:volume => current)
---
SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "order_items" ("created_at", "issue_id", "order_id", "quantity", "total_price", "unit_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-30 20:29:30.674890"], ["issue_id", 1], ["order_id", 1], ["quantity", 1], ["total_price", 3.99], ["unit_price", 3.99], ["updated_at", "2015-01-30 20:29:30.674890"]]
INSERT INTO "orders" ("created_at", "order_status_id", "shipping", "subtotal", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-02-15 14:10:38.672707"], ["order_status_id", 1], ["shipping", 5.0], ["subtotal", 10.35], ["total", 15.35], ["updated_at", "2015-02-15 14:10:38.672707"]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "orders" SET "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = 1  [["subtotal", 10.89], ["updated_at", "2015-01-30 20:31:21.862657"]]

  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    current_quantity = @order_item.quantity
    updated_quantity = order_item_params[:quantity].to_i

    @issue = Issue.find(@order_item.issue_id)
    current = @issue.volume

    if current_quantity > updated_quantity
      diff = current_quantity - updated_quantity
      #if diff < current
        current = current + diff
        #else
        #break
        #end
    else
      diff = updated_quantity - current_quantity
      #if diff < current
        current = current - diff
        #else
        #break
        #end
    end

    @issue.update_attributes(:volume => current)
---
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT 1  [["order_id", 3], ["id", 23]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "order_items" SET "quantity" = ?, "total_price" = ?, "updated_at" = ? WHERE "order_items"."id" = 23  [["quantity", 3], ["total_price", 10.35], ["updated_at", "2015-02-01 13:54:17.754031"]]

  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy
---
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT 1  [["order_id", 3], ["id", 22]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 22]]