app/controllers/users_controller.rb

INSERT INTO "users" ("apartment", "building", "city", "created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "last_request_at", "login", "login_count", "name", "password_salt", "perishable_token", "persistence_token", "single_access_token", "street", "surname", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save

UPDATE "users" SET "last_request_at" = ?, "perishable_token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["last_request_at", "2015-01-25 19:38:36.015739"], ["perishable_token", "YbjH33z76sJysbMeh17"], ["updated_at", "2015-01-25 19:38:36.016258"]]
---
  def update
    @user = current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])