app/views/layouts/_cart_text.html.erb

<%= link_to "#{current_order.order_items.size} Item(s) in Cart ( #{number_to_currency current_order.subtotal} )", cart_path, class: "btn btn-link" %>
---
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT 1  [["order_id", 3], ["id", 22]]
SELECT COUNT(*) FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 1]]